recipes/tofu-mac-n-cheese.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tofu Mac N Cheese</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">Tofu Mac N Cheese</h1>
<p>
<a href="https://www.instagram.com/p/C33Av3XPJrh/">Original link</a>
</p>

<div id="outline-container-orge9737ea" class="outline-2">
<h2 id="orge9737ea">Ingredients</h2>
<div class="outline-text-2" id="text-orge9737ea">
</div>
<div id="outline-container-org83dd29b" class="outline-3">
<h3 id="org83dd29b">Macaroni</h3>
<div class="outline-text-3" id="text-org83dd29b">
<ul class="org-ul">
<li>300g macaroni</li>
<li>2 heaped tbsp vegan butter/margarine</li>
<li>1 heaped tbsp flour</li>
<li>500ml unsweetened plant milk</li>
<li>1/3 cup (~50g) nutritional yeast</li>
<li>300g silken tofu</li>
<li>2 tsp apple cider vinegar</li>
<li>1 tsp miso paste</li>
<li>0.5 tsp turmeric powder</li>
<li>0.5 tsp garlic granules</li>
<li>Salt to taste</li>
</ul>
</div>
</div>

<div id="outline-container-org023daa8" class="outline-3">
<h3 id="org023daa8">Gochugang Tofu</h3>
<div class="outline-text-3" id="text-org023daa8">
<ul class="org-ul">
<li>400g super-firm tofu</li>
<li>1 heaped tbsp cornflour (cornstarch)</li>
<li>1 tbsp sesame oil</li>
<li>1 heaped tbsp gochujang</li>
<li>2 tbsp light soy</li>
<li>2 tbsp maple syrup</li>
<li>0.5 tsp garlic granules</li>
<li>3 tbsp water</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5024ec7" class="outline-2">
<h2 id="org5024ec7">Instructions</h2>
<div class="outline-text-2" id="text-org5024ec7">
</div>
<div id="outline-container-org35a9c22" class="outline-3">
<h3 id="org35a9c22">For the mac</h3>
<div class="outline-text-3" id="text-org35a9c22">
<ol class="org-ol">
<li>Cook the macaroni in salted boiling water until al dente.</li>
<li>In a saucepan, melt the butter over a medium heat.</li>
<li>Add the flour and whisk to combine, then little by little add the milk to make a smooth roux. Gradually keeping adding the milk, whisking to combine.</li>
<li>Once all the milk is in, add the remaining ingredients and whisk well to combine. If the sauce is too thick, add some more milk.</li>
<li>Season to taste and when you’re happy, stir in the cooked macaroni.</li>
</ol>
</div>
</div>

<div id="outline-container-org6a5e23d" class="outline-3">
<h3 id="org6a5e23d">For the gochujang tofu</h3>
<div class="outline-text-3" id="text-org6a5e23d">
<ol class="org-ol">
<li>Rip or chop the tofu into chunks, toss in the cornflour and then toss in the oil.</li>
<li>Air fry the tofu for 8-10 minutes at 200&amp;deg;C until crisp - alternatively, you can fry or bake it.</li>
<li>Mix the sauce ingredients, add to a frying pan and bring to a simmer.</li>
<li>Simmer away for a couple of minutes until it thickens a little and starts to get real sticky then throw the tofu in and coat it in the sauce.</li>
</ol>

<p>
Serve the gochujang tofu with the mac &amp; cheese, top with spring onions, sesame seeds &amp; crispy chilli oil.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
